Reports/МатериальныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>МатериальныйОтчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объединить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порожняя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьНулевых</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подробно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/МатериальныйОтчет/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.Сформировать(ТабДок);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
	    СтандартнаяОбработка = Ложь;
		
		ЗначенияЗаполнения = Новый Структура("Период,Организация,Склад,Товар,ПоГруппам,Объединить,Порожняя,ИсключитьНулевых,Подробно", Отчет.Период, Отчет.Организация, Отчет.Склад, Отчет.Товар, Отчет.ПоГруппам, Отчет.Объединить, Отчет.Порожняя, Отчет.ИсключитьНулевых, Истина);
		
		Для Каждого ПараметрРасшифровки Из Расшифровка Цикл
			ЗначенияЗаполнения.Вставить(ПараметрРасшифровки.Ключ, ПараметрРасшифровки.Значение);
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму(ЭтотОбъект.ИмяФормы, ПараметрыФормы,, Новый УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		СтандартнаяОбработка = Истина;
		
		Для Каждого ПараметрЗаполнения Из Параметры.ЗначенияЗаполнения Цикл
			Отчет[ПараметрЗаполнения.Ключ] = ПараметрЗаполнения.Значение;
		КонецЦикла;
		
		СформироватьНаСервере();
	Иначе
		Отчет.Период = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "Период");
		Отчет.Организация = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "Организация");
		Отчет.Склад = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "Склад");
		Отчет.Товар = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "Товар");
		Отчет.ПоГруппам = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "ПоГруппам");
		Отчет.Объединить = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "Объединить");
		Отчет.Порожняя = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "Порожняя");
		Отчет.ИсключитьНулевых = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "ИсключитьНулевых");
		Отчет.Подробно = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "Подробно");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "Период", Отчет.Период);
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "Организация", Отчет.Организация);
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "Склад", Отчет.Склад);
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "Товар", Отчет.Товар);
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "ПоГруппам", Отчет.ПоГруппам);
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "Объединить", Отчет.Объединить);
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "Порожняя", Отчет.Порожняя);
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "ИсключитьНулевых", Отчет.ИсключитьНулевых);
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "Подробно", Отчет.Подробно);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы = Ложь Тогда
		ПередЗакрытиемНаСервере();
	КонецЕсли;
КонецПроцедуры
